.orkestrel/veneer/engine/units/j-release-record-2-mutant-helpers.diff
--- src/browser/helpers.ts	2026-09-25 06:06:10.757321600 -0400
+++ /c/Users/mikes/WebstormProjects/veneer/tmp/worktrees/release-record/tmp/j-release-record/mutants/r2-helpers.ts	2026-09-25 05:57:28.453047200 -0400
@@ -995,7 +995,7 @@
 		recorded || matchesHostValue(target, next)
 			? writes
 			: [...writes, { target, value: readHostValue(target), priority: readHostPriority(target) }]
-	snapshot.write(target, next)
+	writeHostValue(target, next)
 	return records
 }
 
