.orkestrel/veneer/engine/units/j-release-record-mutant-Toast.diff
--- src/browser/Toast.ts	2026-09-25 05:30:45.757580400 -0400
+++ /c/Users/mikes/WebstormProjects/veneer/tmp/worktrees/release-record/tmp/j-release-record/mutants/Toast.ts	2026-09-25 05:30:17.575941000 -0400
@@ -198,6 +198,9 @@
 		// write to it, so the returning step writes it back. A reaction runs inside each write, so the
 		// door follows it.
 		const snapshot = this.#snapshot
+		for (const name of [this.#classes.shown, this.#classes.transition, this.#classes.fade]) {
+			this.#snapshot.save({ category: 'token', element: this.#host, name })
+		}
 		let written: readonly HostWrite[] = []
 		if (this.#animated) {
 			written = recordHostWrite(
@@ -258,6 +261,9 @@
 		// Each write goes through the snapshot and each token the call changes is recorded, as in
 		// `show`.
 		const snapshot = this.#snapshot
+		for (const name of [this.#classes.shown, this.#classes.transition, this.#classes.fade]) {
+			this.#snapshot.save({ category: 'token', element: this.#host, name })
+		}
 		let written: readonly HostWrite[] = []
 		// The layout read lets a toast inserted shown in this task fade out.
 		reflow(host)
